export default function IconCorrect({ className }) {
  return (
    <svg 
      viewBox="0 0 300 300" 
      className={className} // รับค่า hover:text-white จากข้างนอก
      xmlns="http://www.w3.org/2000/svg">


      <g fill="currentColor"> 
        <path d="M150,75c-41.42,0-75,33.58-75,75c0,41.42,33.58,75,75,75s75-33.58,75-75C225,108.58,191.42,75,150,75z
	 M190.36,133.95l-53.42,53.42c-1.57,1.56-3.61,2.34-5.66,2.34c-2.05,0-4.09-0.78-5.66-2.34l-15.98-15.98
	c-3.12-3.13-3.12-8.19,0-11.32c3.13-3.12,8.19-3.12,11.32,0l10.32,10.33l47.76-47.77c3.13-3.12,8.19-3.12,11.32,0
	C193.48,125.76,193.48,130.82,190.36,133.95z" /> {/* ก๊อปเฉพาะ d="..." มาวาง */}
      </g>
    </svg>
  );
}