export default function IconFacebook({ className }) {
  return (
    <svg 
      width={45}   // 2. กำหนดความกว้าง
      height={45}  // 3. กำหนดความสูง
      viewBox="0 0 300 300" 
      className={className} // รับค่า hover:text-white จากข้างนอก
      xmlns="http://www.w3.org/2000/svg">


      <g fill="currentColor"> 
        <path d="M150,5C69.92,5,5,69.92,5,150s64.92,145,145,145c80.08,0,145-64.92,145-145S230.08,5,150,5z M207.08,78.21
	h-16.99c-16.73,0-21.95,10.38-21.95,21.04v25.27h37.36l-5.97,38.93h-31.38v94.12h-42.09v-94.12h-34.2v-38.93h34.2V94.83
	c0-33.76,20.11-52.4,50.87-52.4c14.74,0,30.15,2.63,30.15,2.63V78.21z" /> {/* ก๊อปเฉพาะ d="..." มาวาง */}
      </g>
    </svg>
  );
}